// locales/zh_CN.ts
export default {
    dispenser_description: `消耗: 100
发射器是你的第一道防线，它们发射箭来保卫你的房子。

技能：朝前方发射大量箭矢

伤害：中等

“有人问我为什么我能不需要红石就能发射箭，还有人问我为什么我能发射无数的箭。”发射器顿了一顿，“第一，我的栅栏连着一个脉冲，第二，我内部的弓附有耐久450和无限I。啥？你问我为啥会说话？

提升等级可以略微提升攻击伤害
5级 - 降低消耗至75
9级 - 星之碎片能力的箭矢可以穿透目标`,
    furnace_description: `消耗: 50
熔炉能为你自动生产红石

技能：生成大量红石

提供机械能：中等

有人闲得慌在它下面安装了一个连着矿场的投掷器。哦，这个矿场是靠地热能的

提升等级可以略微减少产能间隔
5级 - 中幅度减少第一次产能间隔
9级 - 每次产能提高至40`,

    obsidian_description: `消耗: 50
黑曜石的强力装甲能够抵御僵尸的攻击。

技能：恢复所有生命值，并获得更加坚硬的护甲

生命：高

提升等级可以略微提升生命值
5级 - 中幅度减少冷却时间
9级 - 星之碎片装甲抗性大幅度提高
`,
    tnt_mines_description: `消耗: 25
地雷TNT在一定时间的装填后能够炸飞接近的僵尸。

伤害：极高

地雷TNT为什么需要时间来填装？这的确是个千古难题。如果它能瞬间出来的话那还怕什么呢？但在它看来，这件事挺正常的。用它的话来说，就是“老子在睡觉！

提升等级可以略微减少装填时间 
5级 - 冷却时间大幅度减少
9级 - 爆炸范围向前略微扩大

    `,


    small_dispenser_description: `消耗: 0
    
小型发射器能发射短距离的雪球。

技能：射出一个越滚越大的雪球

伤害：中等

白天失效

雪球里包着石头，别问了。

提升等级可以略微提升攻击伤害
5级 - 攻击范围中幅度增加
9级 - 白天不会睡觉
`,
    start: '开始游戏',
}