// locales/zh_CN.ts
export default {
    dispenser_description: `发射器是你的第一道防线，它们发射箭来保卫你的房子。

技能：朝前方发射大量箭矢

伤害：中等

“有人问我为什么我能不需要红石就能发射箭，还有人问我为什么我能发射无数的箭。”发射器顿了一顿，“第一，我的栅栏连着一个脉冲，第二，我内部的弓附有耐久450和无限I。啥？你问我为啥会说话？”`,
    furnace_description: `熔炉能为你提供额外的红石。

技能：生成大量红石

提供机械能：中等

有人闲得慌在它下面安装了一个连着矿场的投掷器。哦，这个矿场是靠地热能的`,

    obsidian_description: `黑曜石的强力装甲能够抵御僵尸的攻击。

技能：恢复所有生命值，并获得更加坚硬的护甲

生命：高

听说把黑曜石摆成地狱门的形状再放一个熔炉有惊喜。不如试试看？`,

    small_dispenser_description: `小型发射器能发射短距离的雪球。

技能：射出一个越滚越大的雪球

伤害：中等

白天失效

雪球里包着石头，别问了。`,
    welcome: '2334'
}