export default {
    start: '开始游戏'
,
    update_log: `v0.0.3
2025.3.??: 第一章体验版第二次更新
- 完成了第一章的两个精英关,现在你可以和???与???进行对战
- 器械:广域南瓜派,寒冰炸弹
- 怪物: 撑杆僵尸,唤魔者,卫道士(替换原来的僵尸猪人,僵尸猪人将在未来的版本上线)
v0.0.2
2025.3.15: 第一章体验版更新
- 完成了第一章除精英关和Boss关以外的关卡,当前版本出怪表难度可能不合理
- 器械:发射器,熔炉,黑曜石,地雷TNT,小发射器,睡莲,瞬炸TNT,生物质发电机,阴森南瓜头,魔术粉
- 怪物:僵尸,皮帽僵尸,铁盔僵尸,矿工僵尸,铁盔矿工僵尸,骷髅弓箭手
- 游戏外强化功能尚未实装,材料机制尚未实装,你可以通过修改游戏存档文件来实现植物的手动升级,大部分器械的升级效果尚未实装.
- 下一次实装怪物: 撑杆僵尸,僵尸猪人,唤魔者
v0.0.1 - 初始版本发布
- 3种器械,2种僵尸,2种bullet
- 包含测试关卡
- 图鉴
- 存档管理
- 出怪表机制
2025.3.7: 启程`
,
    sg5: `继续前进,地下积水形成的天然湖泊挡住了前进的路
铁匠: 别慌,用新获得的睡莲承载器械,另外去主页的商店解锁一个新的卡槽吧
--- 精英波 ---
二人在被怪物吞没前敲破了黑曜石墙,发现了一条新的路
Alex: 没想到这矿洞下面别有一番洞天
铁匠: 奇怪,若干年前我来探险的时候没有这些地形呀
Alex: 1.18洞穴更新改的.
铁匠: 为什么我感觉我的视野在一亮一闪,那个发出尖啸声音的东西是什么
Alex: 快停下!!!他对声音敏感!!!!!`
,
    obsidian_description: `消耗: 50
黑曜石的强力装甲能够抵御僵尸的攻击。
技能：恢复所有生命值，并获得更加坚硬的护甲
生命：高
这块黑曜石是人造的
提升等级可以略微提升生命值
5级 - 中幅度减少冷却时间
9级 - 星之碎片装甲抗性大幅度提高`
,
    tnt_description: `消耗:150
TNT可以在3x3范围内造成高额爆炸伤害
技能: 在爆炸前使用星之碎片可以向周边造成同等的2次同等的TNT爆炸
为什么MVZ443少了驱动这一游戏机制,因为scarletborder根本没有拓展这个接口哈哈哈哈.
升级可以略微减少冷却时间
5级-伤害增加30%
7级-爆炸后原地留下短时间的集束炸弹,3秒后再次爆炸`
,
    leather: `皮革`
,
    iron: `铁锭`
,
    pumpkin_description: `消耗:100
向前发射中距离激光造成大范围伤害
技能:前方一列发射激光(无法对空)
铁匠拾起了steve丢下的灵魂熔炉,但是其已无法正常发射,因此铁匠给他塞入了由绯色金属制作的手电筒可以发射贯穿激光
提高等级可以略微提高伤害
5级 - 加速攻击
9级 - 攻击造成减速效果`
,
    small_dispenser_description: `消耗: 0
小型发射器能发射短距离的雪球。
技能：射出一个长距离爆炸雪球
伤害：中等
光敏器械,强光环境失效
雪球里包着石头，别问了。
提升等级可以略微提升攻击伤害
5级 - 攻击范围中幅度增加
9级 - 强光环境不会失效
`
,
    sg3: `解决完毕了聚集在矿洞外围的怪物后,二人继续前行
Alex: 矿洞内的刷怪量与外边的世界比起来可不是差了一点两点,就像放了过去overworld的十几个刷怪笼
铁匠:看来全overworld的怪物的消失与那个叫做幻想乡的异世界脱不了干系,我们继续前进.另外,如果你发觉现有的器械对抗这些怪物稍有吃力,可以在我这里使用原材料为他们升级.
Alex:呀,真感谢你的帮助,只要继续前进就好了，只要不停下脚步，道路就会...不断延伸?呃呃呃,这黑灯瞎火的地方太阳能板停止运作了,还好光敏植物可以开始运作
--- 精英波 ---
二人没有找到继续深入的路,因此回到了这里
Alex:啊,这矿洞根本没有和幻想乡连接的道路吗~
铁匠:根据我的记忆,呃呃呃(此时二人的眼前出现了一大块黑曜石),不过之前来的时候有这块石头挡路吗?(拿起铁镐敲击)
(敲击的声音引起了洞穴里怪物的注意)
Alex:小心,那群怪物来了!`
,
    sg1: `自从Steve离开后,平日里袭击村庄的怪物数量在逐日减少
Alex: 你说Steve出门冒险后,overworld里的怪物种群在变小,这是否意味着Steve他们遇到了更多的怪物?
铁匠: 我猜想你是对的,Steve可能确实遇到了棘手的麻烦,虽然他的实力很强并且还有图书管理员伴他左右
Alex:我们需要去帮助他们!用这些遗留的器械!
铁匠wait,他们来了,现在放置你的器械抵御他们,同时重拾过去的使用经验吧.`
,
    cp1: `这个故事发生在Steve与坑爹村民前往永夜沼泽后的第二度花信.
作为留守在村庄中的Alex非常担心Steve...
而与此同时,overworld到处刷怪量急剧减少,机器由于原材料的短缺逐渐停工,工业化的村庄面临着无法供养庞大村民的问题.
是时候站出来解决这场overworld的异变了.`
,
    gold: `金币`
,
    sg4: `深入矿洞视野不断开阔,这里出现的怪物更加强力并且数量更加庞大.
铁匠: 真是奇怪,月光发电机这个时候竟然坏了,否则上一关就会发给你的. 不过好在我收集了一些配件改装了一下,现在它可以自动工作了,不过...
Alex: 不过什么?
铁匠: 不过,你需要借助外力不断摇他
Alex: 汗...那你上场摇他吗
铁匠: 这不是有怪物帮我们摇吗,把他种在前面就好了
`
,
    tnt_mines_description: `消耗: 25
地雷TNT在一定时间的装填后能够炸飞接近的僵尸。
技能:向前方生成两颗已经部署好的TNT地雷
伤害：极高
地雷TNT为什么需要时间来填装？这的确是个千古难题。如果它能瞬间出来的话那还怕什么呢？但在它看来，这件事挺正常的。用它的话来说，就是“老子在睡觉！
提升等级可以略微减少部署时间
5级 - 冷却时间小幅度减少
7级 - 星之碎片能力可以多生成一个TNT地雷
9级 - 爆炸范围向前略微扩大
`
,
    scb: `黯绯结晶`
,
    generator_description: `消耗:50
被僵尸攻击时,将怪物的动能转化为机械能
技能:唤醒周围3x3的所有器械
光敏作物,睡眠时能量转化效率大幅度降低
生命:中
铁匠在收拾steve遗留的器械时找到了月光传感器,但是光伏板已经损坏,于是给他添加了一个脚踏板,这样就可以借助怪物的力量发电了,但是代价又是什么呢?
提升等级可以略微提升生命值
5级 - 白天的能量转化效率中幅度提高
9级 - 提高全天候的能量转化效率
`
,
    lily_description: `消耗:25
为你承载植物
2月8日、18日、28日这三天带8的日子是爱莲之日哦
升级可以略微提升生命值
5级 - 能量消耗减少至0`
,
    magic_powder_description: `消耗:150
对一个怪物造成高额伤害并获得一个星之碎片
无法对其使用星之碎片
粉状器械可以随意在有承载物的地块上放置
铁匠为了解决怪物战利品短缺危机而在永夜沼泽兴建刷怪塔时发现了魔术箱,但是他已经无法正常打开闭合.于是铁匠将他的核心器件和萤石混合磨成了粉,可以对怪物造成伤害的同时生成星之碎片了.
提升等级可以小幅度提高伤害
5级 - 减少花费至125
9级 - 小幅度减少冷却时间
`
,
    sg2: `在将村庄防务问题解决给自动化器械和其他村民后,Alex和铁匠踏上了寻找Steve的路
Alex:还记得Steve他们离开时的场景吗?当时他们兴奋地展示了一张地图,指着永夜沼泽兴奋的说,前往那里就能去往传说中的幻想乡
铁匠:是的,但是现在那处已经被改造成了女巫塔,而施工队没有发现任何结界波动的迹象.不过我还知道一处可能存在时空信道的入口...就是附近的一处矿洞的底层,曾经我做冒险者的时候去过那里.
Alex:你看好多僵尸聚集在那里,还有些僵尸在闪烁发光,我预感击败他们可以获得短时间增强植物能力的重要道具.
`
,
    furnace_description: `消耗: 50
熔炉能为你自动生产红石
技能：生成大量红石
提供机械能：中等
铁匠在原有熔炉的基础上安装了一个连着发电机的矿车轨道，这样就可以自动将红石转化为机械能了
提升等级可以略微减少产能间隔
5级 - 减少能量消耗至35
9级 - 每次产能提高至40`
,
    pumpkin_wan_description: `消耗:325
向周围发射高频激光(无法对空)
需要种植在阴森南瓜头上
光敏作物,睡眠时停止攻击
技能:在周围造成一段时间的持续爆炸(升级无法扩大范围,死亡后依然有效)
如果你觉得广域南瓜派这个名字过于学术,你可以叫他另外一个名字胖平文.
提升等级 可以略微提高伤害
5级 - 减少消耗到275
9级 - 攻击范围扩大到5x5
`
,
    dispenser_description: `消耗: 100
发射器是你的第一道防线，它们发射箭来保卫你的房子。
技能：朝前方发射大量箭矢
伤害：中等
“有人问我为什么我能不需要红石就能发射箭，还有人问我为什么我能发射无数的箭。”发射器顿了一顿，“第一，我的栅栏连着一个脉冲，第二，我内部的弓附有耐久450和无限I。啥？你问我为啥会说话？
提升等级可以略微提升攻击伤害
3级 - 所有箭矢可以穿透一个目标
5级 - 星之碎片能力箭矢多穿透一个目标
7级 - 所有箭矢可以额外穿透一个目标
9级 - 降低消耗至75
`
,
    ice_bomb_description: `消耗: 75
爆炸,并且冻结全屏敌人,并在解冻后减速敌人一段时间
无法对其使用星之碎片
寒冰炸弹一直想摆脱人们对他是控制卡片的固有看法,于是他拼命锻炼,现在他有伤害了
提升等级可以略微提高伤害
5级 - 大幅度增加造成的伤害
9级 - 减少冷却时间
`
,
}
